#+TITLE: Everyone should learn C
#+DATE: <2022-09-12 Mon>
#+TAGS[]: computer-science

Everyone that is going into computer science should learn how to write C.

I can hear people saying, "But who uses C in 2022? That's for boomers and a waste of time. I'm just going to write everything in my epic wholesome language like Python or JS. That way, I have more time to play Valorant and look at my phone more than my parents."

My reasons that I will list here isn't because C is fast. We all know that C is fast. However, not all of us are going to build an entire operating system, web browser, text editor, etc. And it's also not because there is a lot of demand for C either.

I am going to appear arrogant and unapologetic, but I assume anyone that doesn't know basic C knows less of what they are doing when they program in another language. That, however, does not actually bar you from writing anything good if you have no knowledge of C; plenty of popular software have been written by people who do not know any C.

But how are you going to know how a computer works or how a computer thinks?

* You will understand what you write

C# was one of the first languages I learned. One of the things that used to bug me was why different types are passed, compared, and set etc. by value or by reference.

Here we have an example C# program:

#+begin_src csharp
class Program
{
    struct TestStruct
    {
        public int val;
    }

    class TestClass
    {
        public int val;
    }

    static void Main(string[] args)
    {
        TestStruct forsen = new TestStruct { val = 0 };
        TestStruct weeb = new TestStruct { val = 0 };

        TestClass velcuz = new TestClass { val = 0 };
        TestClass funny = new TestClass { val = 0 };

        Console.WriteLine($"forsen is weeb: {forsen == weeb}");
        Console.WriteLine($"velcuz is funny: {velcuz == funny}");
        Console.WriteLine($"velcuz is weeb: {velcuz.val == weeb.val}");
    }
}
#+end_src

#+RESULTS:
: forsen is weeb: true
: velcuz is funny: false
: velcuz is weeb: true

You will notice that when you compare ~forsen~ and ~weeb~, their values are compared, not their reference, so ~forsen == weeb~.

But ~velcuz~ and ~funny~ are reference types, so the addresses they are pointing to are compared.

You will also notice that ~velcuz.val~ is equal to ~weeb.val~, and since they are both ~int~, they are compared by value.

If you were starting to learn, it seems to be confusing because there isn't really a way to distinguish a value and a reference.

Here's the same example but in C.

#+begin_src c
struct test_struct {
  int val;
};

int main() {
  const SIZE = sizeof(struct test_struct);

  struct test_struct forsen = { .val = 0 };
  struct test_struct weeb = { .val = 0 };

  struct test_struct *velcuz = (struct test_struct*)malloc(SIZE);
  velcuz->val = 0;

  struct test_struct *funny = (struct test_struct*)malloc(SIZE);
  funny->val = 0;

  printf("forsen is weeb: %s\n",
         memcmp(&forsen, &weeb, SIZE) == 0 ? "true" : "false");
  printf("velcuz is funny: %s\n",
         memcmp(&velcuz, &funny, SIZE) == 0 ? "true" : "false");
  printf("velcuz is weeb: %s\n",
         memcmp(&velcuz->val, &weeb.val, SIZE) == 0 ? "true" : "false");

  return 0;
}
#+end_src

#+RESULTS:
: forsen is weeb: true
: velcuz is funny: false
: velcuz is weeb: true

C, however, distinguishes values and references with pointers and reference operations. It lets you understand how values and references are compared. The nature of pointers and references are become a lot more obvious, whereas in C#, it just appears to be more theoretical.

